**MEMULAI PANDAS**

In [1]:
import pandas as pd
import numpy as np

**STRUKTUR DATA DALAM PANDAS**

**Series**

In [2]:
series = pd.Series([1, 3, 5, 7])

print(series)
print(type(series))

0    1
1    3
2    5
3    7
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
series_2 = pd.Series([1, 2, 4, 7, 10])

print(series_2.index)

RangeIndex(start=0, stop=5, step=1)

In [4]:
series.values

array([1, 3, 5, 7], dtype=int64)

In [5]:
series_name_index = pd.Series([1, 3, 5, 7], index=["one", "three", "five", "seven"])

print(series_name_index.index)

Index(['one', 'three', 'five', 'seven'], dtype='object')

In [6]:
series_name_index.index = ["a", "b", "c", "d"]

In [7]:
series_name_index

a    1
b    3
c    5
d    7
dtype: int64

In [8]:
total_cases = {"Indonesia": 1976172.0, "Malaysia": 691115.0, "Singapore": 62403.0, "Thailand": 214449.0}
series_from_dict = pd.Series(total_cases)

print(series_from_dict)

Indonesia    1976172.0
Malaysia      691115.0
Singapore      62403.0
Thailand      214449.0
dtype: float64

In [9]:
country = ["Singapore", "Thailand", "India", "Indonesia"]
series_from_dict = pd.Series(total_cases, index=country)

print(series_from_dict)

Singapore      62403.0
Thailand      214449.0
India              NaN
Indonesia    1976172.0
dtype: float64

In [10]:
series_with_name = pd.Series(total_cases, name="covid_cases")

print(series_with_name)

Indonesia    1976172.0
Malaysia      691115.0
Singapore      62403.0
Thailand      214449.0
Name: covid_cases, dtype: float64

In [11]:
print(series_with_name.name)

covid_cases

In [12]:
series_with_name.name = "covid_total_cases"

print(series_with_name)

Indonesia    1976172.0
Malaysia      691115.0
Singapore      62403.0
Thailand      214449.0
Name: covid_total_cases, dtype: float64

**Data Frame**

In [13]:
df = pd.DataFrame([["John", 28], ["Sarah", 42], ["Michael", 19], ["Terminator", 103]])
df

            0    1
0        John   28
1       Sarah   42
2     Michael   19
3  Terminator  103

In [14]:
df = pd.DataFrame([["John", 28], ["Sarah", 42], ["Michael", 19], ["Terminator", 103]],
                 index=["jo", "sa", "mi", "tr"],
                 columns=["Name", "Score"])
df

          Name  Score
jo        John     28
sa       Sarah     42
mi     Michael     19
tr  Terminator    103

In [15]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
       "year": [2000, 2001, 2002, 2001, 2002, 2003],
       "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
df_from_dict = pd.DataFrame(data)
df_from_dict

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [16]:
print(df_from_dict["state"])
print(df_from_dict["year"])
print(df_from_dict["pop"])

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object
0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64
0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [17]:
df_with_columns = pd.DataFrame(data, columns=["year", "debt", "state", "pop"])
df_with_columns

   year debt   state  pop
0  2000  NaN    Ohio  1.5
1  2001  NaN    Ohio  1.7
2  2002  NaN    Ohio  3.6
3  2001  NaN  Nevada  2.4
4  2002  NaN  Nevada  2.9
5  2003  NaN  Nevada  3.2

In [18]:
df_with_columns.columns

Index(['year', 'debt', 'state', 'pop'], dtype='object')

In [19]:
df_with_columns.index

RangeIndex(start=0, stop=6, step=1)

In [20]:
pop = {"Nevada": {2001: 2.4, 2002: 2.9},
      "Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}}
df_with_columns_index = pd.DataFrame(pop)
df_with_columns_index

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [21]:
df_with_columns_index.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

KUIS

In [22]:
s1 = pd.Series(["Jakarta", "Surabaya", "Bandung", "Semarang", "Kudus"], name="city")
s2 = pd.Series([12.4, 5.6, 8.12, 5.5, 4.7, 8.6], name="cases")

print(s1.values)
print(s2.values)

['Jakarta' 'Surabaya' 'Bandung' 'Semarang' 'Kudus']
[12.4   5.6   8.12  5.5   4.7   8.6 ]

In [23]:
df_another_kuis = pd.concat([s1,s2], axis=1)
df_another_kuis

       city  cases
0   Jakarta  12.40
1  Surabaya   5.60
2   Bandung   8.12
3  Semarang   5.50
4     Kudus   4.70
5       NaN   8.60

In [24]:
dict_kuis = {s1.name: s1,
            s2.name: s2}
df_kuis_1 = pd.DataFrame(dict_kuis)
df_kuis_1

       city  cases
0   Jakarta  12.40
1  Surabaya   5.60
2   Bandung   8.12
3  Semarang   5.50
4     Kudus   4.70
5       NaN   8.60

In [25]:
df_kuis_1.columns = ["cities", "total_cases"]
df_kuis_1

     cities  total_cases
0   Jakarta        12.40
1  Surabaya         5.60
2   Bandung         8.12
3  Semarang         5.50
4     Kudus         4.70
5       NaN         8.60

**PENGAKSESAN DATA DENGAN INDEXING DAN SLICING**

**Indexing dan Slicing pada Series**

In [26]:
print(series)
print()
print(series[1])
print()
print(series[:2])

0    1
1    3
2    5
3    7
dtype: int64

3

0    1
1    3
dtype: int64

In [27]:
series_name_index

a    1
b    3
c    5
d    7
dtype: int64

In [28]:
print(series_name_index["a"])
series_name_index["a":"c"]

1

a    1
b    3
c    5
dtype: int64

In [29]:
series_with_name

Indonesia    1976172.0
Malaysia      691115.0
Singapore      62403.0
Thailand      214449.0
Name: covid_total_cases, dtype: float64

In [30]:
series_with_name[series_with_name > 100000]

Indonesia    1976172.0
Malaysia      691115.0
Thailand      214449.0
Name: covid_total_cases, dtype: float64

In [31]:
series_with_name[["Singapore", "Thailand", "Malaysia", "Indonesia"]]

Singapore      62403.0
Thailand      214449.0
Malaysia      691115.0
Indonesia    1976172.0
Name: covid_total_cases, dtype: float64

In [32]:
series_name_index[["d", "a", "c", "b"]]

d    7
a    1
c    5
b    3
dtype: int64

In [33]:
series_with_name["Singapore"] = 100000

series_with_name

Indonesia    1976172.0
Malaysia      691115.0
Singapore     100000.0
Thailand      214449.0
Name: covid_total_cases, dtype: float64

**Indexing dan Slicing pada Data Frame**

In [34]:
df_from_dict

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [35]:
df_from_dict["year"]

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [36]:
df_from_dict["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [37]:
df

          Name  Score
jo        John     28
sa       Sarah     42
mi     Michael     19
tr  Terminator    103

In [38]:
df["Name"]

jo          John
sa         Sarah
mi       Michael
tr    Terminator
Name: Name, dtype: object

In [39]:
df_from_dict.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [40]:
df_from_dict[["year", "pop", "state"]]

   year  pop   state
0  2000  1.5    Ohio
1  2001  1.7    Ohio
2  2002  3.6    Ohio
3  2001  2.4  Nevada
4  2002  2.9  Nevada
5  2003  3.2  Nevada

In [41]:
df_with_columns["debt"] = 15.5
df_with_columns

   year  debt   state  pop
0  2000  15.5    Ohio  1.5
1  2001  15.5    Ohio  1.7
2  2002  15.5    Ohio  3.6
3  2001  15.5  Nevada  2.4
4  2002  15.5  Nevada  2.9
5  2003  15.5  Nevada  3.2

In [42]:
df_with_columns["debt"] = np.arange(6.)
df_with_columns

   year  debt   state  pop
0  2000   0.0    Ohio  1.5
1  2001   1.0    Ohio  1.7
2  2002   2.0    Ohio  3.6
3  2001   3.0  Nevada  2.4
4  2002   4.0  Nevada  2.9
5  2003   5.0  Nevada  3.2

In [43]:
df_with_columns["debt"] = pd.Series([1., -2, 1.5, -1.5, 1.6, 1.7])
df_with_columns

   year  debt   state  pop
0  2000   1.0    Ohio  1.5
1  2001  -2.0    Ohio  1.7
2  2002   1.5    Ohio  3.6
3  2001  -1.5  Nevada  2.4
4  2002   1.6  Nevada  2.9
5  2003   1.7  Nevada  3.2

In [44]:
df_with_columns["debt"] = pd.Series([1., -2, 1.5, -1.5, 1.6, 1.7], index=np.arange(5, -1, -1))
df_with_columns

   year  debt   state  pop
0  2000   1.7    Ohio  1.5
1  2001   1.6    Ohio  1.7
2  2002  -1.5    Ohio  3.6
3  2001   1.5  Nevada  2.4
4  2002  -2.0  Nevada  2.9
5  2003   1.0  Nevada  3.2

In [45]:
df_with_columns["debt"] = pd.Series([1., -2, 1.5, -1.5, 1.6, 1.7], index=np.arange(10, -1, -2))
df_with_columns

   year  debt   state  pop
0  2000   1.7    Ohio  1.5
1  2001   NaN    Ohio  1.7
2  2002   1.6    Ohio  3.6
3  2001   NaN  Nevada  2.4
4  2002  -1.5  Nevada  2.9
5  2003   NaN  Nevada  3.2

In [46]:
df_with_columns[df_with_columns["state"] == "Ohio"]

   year  debt state  pop
0  2000   1.7  Ohio  1.5
1  2001   NaN  Ohio  1.7
2  2002   1.6  Ohio  3.6

In [47]:
df_with_columns[(df_with_columns["year"] >= 2001) & (df_with_columns["pop"] < 3.)]

   year  debt   state  pop
1  2001   NaN    Ohio  1.7
3  2001   NaN  Nevada  2.4
4  2002  -1.5  Nevada  2.9

**Pengindeksan dengan loc dan iloc**

In [48]:
df_from_dict

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [49]:
df_from_dict.loc[:, "state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [50]:
df_from_dict.iloc[:, 0]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [51]:
df_from_dict.loc[[True, False, True, False, True, False], ["state", "pop"]]

    state  pop
0    Ohio  1.5
2    Ohio  3.6
4  Nevada  2.9

In [52]:
print(df_from_dict)

df_from_dict.loc[df_from_dict.index % 2 != 0, ["state", "pop"]]

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

    state  pop
1    Ohio  1.7
3  Nevada  2.4
5  Nevada  3.2

In [53]:
series_from_dict

Singapore      62403.0
Thailand      214449.0
India              NaN
Indonesia    1976172.0
dtype: float64

In [54]:
series_from_dict.loc["Singapore":"Thailand"]

Singapore     62403.0
Thailand     214449.0
dtype: float64

**TIPE DATA BAWAAN PANDA**

In [55]:
df = pd.DataFrame({
    "float": np.random.rand(3),
    "int": 10,
    "object": "bitlabs",
    "boolean": True,
    "int8": pd.Series([1]*3, dtype="int8"),
    "float32": pd.Series([1.]*3, dtype="float32")
})

In [56]:
df.dtypes

float      float64
int          int64
object      object
boolean       bool
int8          int8
float32    float32
dtype: object

In [57]:
series_from_dict.dtype

dtype('float64')

**FUNGIONALITAS DALAM PANDAS**

**Head and Tail**

In [58]:
series.head()

0    1
1    3
2    5
3    7
dtype: int64

In [59]:
series.tail(2)

2    5
3    7
dtype: int64

In [60]:
df_with_columns.head()

   year  debt   state  pop
0  2000   1.7    Ohio  1.5
1  2001   NaN    Ohio  1.7
2  2002   1.6    Ohio  3.6
3  2001   NaN  Nevada  2.4
4  2002  -1.5  Nevada  2.9

In [61]:
df_with_columns.tail(4)

   year  debt   state  pop
2  2002   1.6    Ohio  3.6
3  2001   NaN  Nevada  2.4
4  2002  -1.5  Nevada  2.9
5  2003   NaN  Nevada  3.2

**Ukuran Data**

In [62]:
df_from_dict.shape

(6, 3)

In [63]:
n_rows = df_from_dict.shape[0]
n_cols = df_from_dict.shape[1]

print("num of rows:", n_rows)
print("num of cols:", n_cols)

num of rows: 6
num of cols: 3

**Menghapus Baris atau Kolom**

In [64]:
s3 = pd.Series([4.5, 7.3, -5.4, 3.6], index=["d", "c", "a", "b"])
s3

d    4.5
c    7.3
a   -5.4
b    3.6
dtype: float64

In [65]:
s3.drop("d")

c    7.3
a   -5.4
b    3.6
dtype: float64

In [66]:
s3.drop(["a", "b"])

d    4.5
c    7.3
dtype: float64

In [67]:
df_country = pd.DataFrame(np.arange(16).reshape((4, 4)),
                          index=["Jakarta", "Surabaya", "Bandung", "Kuta"],
                          columns=[2000, 2001, 2002, 2003])
df_country

          2000  2001  2002  2003
Jakarta      0     1     2     3
Surabaya     4     5     6     7
Bandung      8     9    10    11
Kuta        12    13    14    15

In [68]:
df_country.drop(columns=2000)

          2001  2002  2003
Jakarta      1     2     3
Surabaya     5     6     7
Bandung      9    10    11
Kuta        13    14    15

In [69]:
df_country.drop("Kuta")

          2000  2001  2002  2003
Jakarta      0     1     2     3
Surabaya     4     5     6     7
Bandung      8     9    10    11

In [70]:
df_country.drop(index="Jakarta", columns=2003)

          2000  2001  2002
Surabaya     4     5     6
Bandung      8     9    10
Kuta        12    13    14

**Mencari Data Unik atau Duplikat**

In [71]:
df_covid = pd.DataFrame({"id": ["10010", "10009", "10006", "10001", "10002", "10003", "10002", "10001"],
                        "cases": [207, 99, 17, 256, 119, 28, 123, 31]})
total_cases = pd.Series(["subscribed", "not subscribed", "subscribed",
                        "subscribed", "not subscribed", "pending",
                        "not subscribed", "subscribed", "pending",
                        "not subscribed"])

In [72]:
df_covid

      id  cases
0  10010    207
1  10009     99
2  10006     17
3  10001    256
4  10002    119
5  10003     28
6  10002    123
7  10001     31

In [73]:
total_cases

0        subscribed
1    not subscribed
2        subscribed
3        subscribed
4    not subscribed
5           pending
6    not subscribed
7        subscribed
8           pending
9    not subscribed
dtype: object

In [74]:
total_cases.duplicated()

0    False
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8     True
9     True
dtype: bool

In [75]:
total_cases.duplicated(keep="last")

0     True
1     True
2     True
3     True
4     True
5     True
6     True
7    False
8    False
9    False
dtype: bool

In [76]:
df_covid

      id  cases
0  10010    207
1  10009     99
2  10006     17
3  10001    256
4  10002    119
5  10003     28
6  10002    123
7  10001     31

In [77]:
df_covid.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
dtype: bool

In [78]:
df_covid.duplicated(subset="id")

0    False
1    False
2    False
3    False
4    False
5    False
6     True
7     True
dtype: bool

In [79]:
total_cases[~total_cases.duplicated()]

0        subscribed
1    not subscribed
5           pending
dtype: object

In [80]:
total_cases[~total_cases.duplicated(keep="last")]

7        subscribed
8           pending
9    not subscribed
dtype: object

In [81]:
df_covid[~df_covid.duplicated(subset="id")]

      id  cases
0  10010    207
1  10009     99
2  10006     17
3  10001    256
4  10002    119
5  10003     28

In [82]:
total_cases.drop_duplicates()

0        subscribed
1    not subscribed
5           pending
dtype: object

In [83]:
df_covid.drop_duplicates(subset="id", keep="last")

      id  cases
0  10010    207
1  10009     99
2  10006     17
5  10003     28
6  10002    123
7  10001     31

In [84]:
print("nilai unik:", total_cases.unique())
print("jumlah elemen unik", total_cases.nunique())

nilai unik: ['subscribed' 'not subscribed' 'pending']
jumlah elemen unik 3

In [85]:
print("nilai unik:", df_covid.id.unique())
print("jumlah elemen unik", df_covid.id.nunique())

nilai unik: ['10010' '10009' '10006' '10001' '10002' '10003']
jumlah elemen unik 6

In [86]:
total_cases.value_counts()

subscribed        4
not subscribed    4
pending           2
dtype: int64

In [87]:
df_covid.value_counts()

id     cases
10001  31       1
       256      1
10002  119      1
       123      1
10003  28       1
10006  17       1
10009  99       1
10010  207      1
dtype: int64

In [88]:
df_covid.value_counts(subset="id")

id
10001    2
10002    2
10003    1
10006    1
10009    1
10010    1
dtype: int64